// Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).
Console.WriteLine("ВВедите число A ");
int A = Convert.ToInt32(Console.ReadLine());

if (A % 2 == 0) Console.WriteLine("Четное");
else Console.WriteLine("Нечетное");


